###################################################################

# Created by write_sdc on Mon Apr 28 11:47:50 2025

###################################################################
set sdc_version 2.1

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current mA
set_wire_load_mode segmented
set_max_fanout 16 [current_design]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports clk]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports reset]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports start]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_0__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_0__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_0__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_0__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_0__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_1__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_1__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_1__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_1__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_1__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_2__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_2__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_2__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_2__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_2__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_3__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_3__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_3__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_3__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_3__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_4__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_4__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_4__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_4__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_4__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_5__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_5__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_5__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_5__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_5__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_6__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_6__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_6__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_6__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_6__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_7__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_7__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_7__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_7__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_7__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_8__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_8__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_8__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_8__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_8__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_9__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_9__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_9__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_9__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_9__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_10__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_10__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_10__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_10__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_10__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_11__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_11__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_11__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_11__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_11__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_12__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_12__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_12__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_12__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_12__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_13__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_13__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_13__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_13__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_13__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_14__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_14__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_14__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_14__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_14__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_15__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_15__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_15__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_15__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_15__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_16__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_16__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_16__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_16__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_16__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_17__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_17__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_17__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_17__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_17__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_18__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_18__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_18__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_18__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_18__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_19__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_19__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_19__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_19__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_19__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_20__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_20__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_20__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_20__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_20__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_21__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_21__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_21__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_21__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_21__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_22__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_22__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_22__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_22__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_22__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_23__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_23__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_23__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_23__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_23__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_24__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_24__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_24__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_24__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_24__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_25__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_25__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_25__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_25__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_25__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_26__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_26__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_26__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_26__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_26__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_27__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_27__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_27__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_27__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_27__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_28__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_28__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_28__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_28__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_28__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_29__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_29__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_29__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_29__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_29__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_30__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_30__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_30__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_30__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_30__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_31__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_31__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_31__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_31__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_31__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_32__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_32__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_32__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_32__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_32__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_33__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_33__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_33__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_33__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_33__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_34__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_34__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_34__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_34__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_34__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_35__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_35__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_35__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_35__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_35__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_36__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_36__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_36__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_36__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_36__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_37__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_37__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_37__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_37__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_37__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_38__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_38__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_38__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_38__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_38__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_39__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_39__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_39__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_39__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_39__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_40__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_40__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_40__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_40__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_40__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_41__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_41__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_41__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_41__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_41__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_42__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_42__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_42__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_42__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_42__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_43__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_43__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_43__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_43__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_43__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_44__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_44__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_44__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_44__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_44__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_45__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_45__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_45__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_45__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_45__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_46__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_46__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_46__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_46__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_46__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_47__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_47__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_47__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_47__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_47__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_48__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_48__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_48__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_48__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_48__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_49__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_49__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_49__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_49__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_49__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_50__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_50__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_50__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_50__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_50__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_51__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_51__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_51__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_51__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_51__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_52__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_52__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_52__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_52__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_52__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_53__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_53__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_53__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_53__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_53__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_54__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_54__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_54__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_54__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_54__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_55__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_55__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_55__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_55__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_55__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_56__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_56__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_56__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_56__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_56__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_57__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_57__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_57__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_57__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_57__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_58__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_58__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_58__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_58__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_58__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_59__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_59__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_59__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_59__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_59__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_60__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_60__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_60__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_60__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_60__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_61__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_61__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_61__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_61__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_61__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_62__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_62__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_62__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_62__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_62__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_63__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_63__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_63__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_63__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_63__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_64__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_64__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_64__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_64__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_64__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_65__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_65__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_65__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_65__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_65__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_66__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_66__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_66__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_66__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_66__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_67__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_67__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_67__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_67__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_67__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_68__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_68__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_68__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_68__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_68__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_69__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_69__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_69__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_69__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_69__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_70__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_70__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_70__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_70__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_70__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_71__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_71__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_71__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_71__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_71__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_72__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_72__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_72__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_72__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_72__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_73__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_73__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_73__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_73__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_73__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_74__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_74__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_74__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_74__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_74__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_75__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_75__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_75__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_75__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_75__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_76__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_76__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_76__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_76__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_76__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_77__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_77__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_77__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_77__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_77__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_78__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_78__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_78__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_78__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_78__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_79__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_79__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_79__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_79__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_79__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_80__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_80__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_80__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_80__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_80__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_81__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_81__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_81__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_81__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_81__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_82__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_82__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_82__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_82__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_82__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_83__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_83__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_83__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_83__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_83__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_84__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_84__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_84__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_84__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_84__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_85__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_85__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_85__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_85__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_85__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_86__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_86__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_86__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_86__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_86__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_87__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_87__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_87__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_87__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_87__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_88__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_88__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_88__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_88__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_88__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_89__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_89__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_89__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_89__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_89__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_90__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_90__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_90__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_90__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_90__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_91__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_91__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_91__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_91__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_91__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_92__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_92__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_92__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_92__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_92__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_93__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_93__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_93__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_93__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_93__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_94__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_94__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_94__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_94__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_94__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_95__4_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_95__3_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_95__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_95__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports data_in_95__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports coo_in_0__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports coo_in_0__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports coo_in_0__0_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports coo_in_1__2_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports coo_in_1__1_]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports coo_in_1__0_]
set_load -pin_load 0.01 [get_ports {read_address[12]}]
set_load -pin_load 0.01 [get_ports {read_address[11]}]
set_load -pin_load 0.01 [get_ports {read_address[10]}]
set_load -pin_load 0.01 [get_ports {read_address[9]}]
set_load -pin_load 0.01 [get_ports {read_address[8]}]
set_load -pin_load 0.01 [get_ports {read_address[7]}]
set_load -pin_load 0.01 [get_ports {read_address[6]}]
set_load -pin_load 0.01 [get_ports {read_address[5]}]
set_load -pin_load 0.01 [get_ports {read_address[4]}]
set_load -pin_load 0.01 [get_ports {read_address[3]}]
set_load -pin_load 0.01 [get_ports {read_address[2]}]
set_load -pin_load 0.01 [get_ports {read_address[1]}]
set_load -pin_load 0.01 [get_ports {read_address[0]}]
set_load -pin_load 0.01 [get_ports enable_read]
set_load -pin_load 0.01 [get_ports {coo_address[2]}]
set_load -pin_load 0.01 [get_ports {coo_address[1]}]
set_load -pin_load 0.01 [get_ports {coo_address[0]}]
set_load -pin_load 0.01 [get_ports done]
set_load -pin_load 0.01 [get_ports max_addi_answer_0__1_]
set_load -pin_load 0.01 [get_ports max_addi_answer_0__0_]
set_load -pin_load 0.01 [get_ports max_addi_answer_1__1_]
set_load -pin_load 0.01 [get_ports max_addi_answer_1__0_]
set_load -pin_load 0.01 [get_ports max_addi_answer_2__1_]
set_load -pin_load 0.01 [get_ports max_addi_answer_2__0_]
set_load -pin_load 0.01 [get_ports max_addi_answer_3__1_]
set_load -pin_load 0.01 [get_ports max_addi_answer_3__0_]
set_load -pin_load 0.01 [get_ports max_addi_answer_4__1_]
set_load -pin_load 0.01 [get_ports max_addi_answer_4__0_]
set_load -pin_load 0.01 [get_ports max_addi_answer_5__1_]
set_load -pin_load 0.01 [get_ports max_addi_answer_5__0_]
create_clock [get_ports clk]  -period 1500  -waveform {0 750}
set_clock_uncertainty 0.01  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  0.1  [get_ports reset]
set_input_delay -clock clk  0.1  [get_ports start]
set_input_delay -clock clk  0.1  [get_ports data_in_0__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_0__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_0__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_0__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_0__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_1__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_1__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_1__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_1__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_1__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_2__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_2__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_2__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_2__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_2__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_3__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_3__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_3__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_3__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_3__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_4__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_4__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_4__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_4__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_4__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_5__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_5__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_5__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_5__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_5__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_6__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_6__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_6__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_6__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_6__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_7__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_7__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_7__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_7__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_7__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_8__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_8__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_8__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_8__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_8__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_9__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_9__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_9__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_9__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_9__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_10__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_10__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_10__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_10__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_10__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_11__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_11__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_11__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_11__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_11__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_12__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_12__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_12__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_12__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_12__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_13__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_13__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_13__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_13__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_13__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_14__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_14__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_14__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_14__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_14__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_15__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_15__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_15__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_15__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_15__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_16__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_16__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_16__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_16__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_16__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_17__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_17__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_17__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_17__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_17__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_18__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_18__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_18__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_18__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_18__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_19__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_19__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_19__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_19__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_19__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_20__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_20__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_20__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_20__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_20__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_21__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_21__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_21__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_21__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_21__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_22__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_22__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_22__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_22__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_22__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_23__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_23__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_23__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_23__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_23__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_24__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_24__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_24__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_24__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_24__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_25__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_25__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_25__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_25__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_25__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_26__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_26__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_26__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_26__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_26__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_27__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_27__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_27__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_27__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_27__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_28__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_28__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_28__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_28__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_28__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_29__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_29__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_29__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_29__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_29__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_30__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_30__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_30__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_30__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_30__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_31__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_31__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_31__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_31__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_31__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_32__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_32__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_32__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_32__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_32__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_33__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_33__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_33__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_33__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_33__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_34__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_34__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_34__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_34__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_34__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_35__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_35__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_35__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_35__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_35__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_36__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_36__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_36__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_36__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_36__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_37__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_37__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_37__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_37__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_37__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_38__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_38__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_38__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_38__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_38__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_39__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_39__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_39__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_39__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_39__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_40__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_40__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_40__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_40__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_40__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_41__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_41__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_41__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_41__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_41__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_42__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_42__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_42__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_42__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_42__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_43__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_43__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_43__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_43__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_43__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_44__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_44__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_44__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_44__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_44__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_45__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_45__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_45__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_45__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_45__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_46__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_46__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_46__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_46__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_46__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_47__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_47__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_47__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_47__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_47__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_48__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_48__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_48__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_48__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_48__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_49__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_49__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_49__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_49__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_49__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_50__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_50__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_50__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_50__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_50__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_51__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_51__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_51__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_51__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_51__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_52__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_52__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_52__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_52__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_52__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_53__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_53__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_53__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_53__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_53__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_54__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_54__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_54__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_54__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_54__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_55__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_55__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_55__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_55__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_55__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_56__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_56__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_56__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_56__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_56__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_57__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_57__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_57__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_57__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_57__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_58__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_58__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_58__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_58__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_58__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_59__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_59__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_59__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_59__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_59__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_60__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_60__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_60__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_60__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_60__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_61__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_61__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_61__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_61__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_61__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_62__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_62__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_62__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_62__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_62__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_63__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_63__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_63__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_63__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_63__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_64__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_64__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_64__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_64__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_64__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_65__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_65__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_65__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_65__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_65__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_66__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_66__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_66__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_66__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_66__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_67__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_67__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_67__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_67__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_67__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_68__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_68__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_68__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_68__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_68__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_69__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_69__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_69__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_69__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_69__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_70__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_70__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_70__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_70__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_70__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_71__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_71__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_71__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_71__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_71__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_72__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_72__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_72__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_72__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_72__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_73__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_73__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_73__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_73__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_73__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_74__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_74__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_74__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_74__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_74__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_75__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_75__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_75__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_75__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_75__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_76__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_76__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_76__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_76__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_76__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_77__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_77__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_77__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_77__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_77__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_78__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_78__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_78__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_78__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_78__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_79__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_79__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_79__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_79__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_79__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_80__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_80__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_80__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_80__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_80__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_81__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_81__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_81__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_81__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_81__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_82__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_82__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_82__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_82__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_82__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_83__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_83__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_83__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_83__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_83__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_84__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_84__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_84__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_84__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_84__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_85__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_85__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_85__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_85__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_85__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_86__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_86__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_86__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_86__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_86__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_87__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_87__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_87__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_87__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_87__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_88__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_88__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_88__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_88__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_88__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_89__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_89__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_89__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_89__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_89__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_90__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_90__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_90__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_90__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_90__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_91__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_91__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_91__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_91__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_91__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_92__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_92__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_92__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_92__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_92__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_93__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_93__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_93__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_93__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_93__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_94__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_94__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_94__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_94__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_94__0_]
set_input_delay -clock clk  0.1  [get_ports data_in_95__4_]
set_input_delay -clock clk  0.1  [get_ports data_in_95__3_]
set_input_delay -clock clk  0.1  [get_ports data_in_95__2_]
set_input_delay -clock clk  0.1  [get_ports data_in_95__1_]
set_input_delay -clock clk  0.1  [get_ports data_in_95__0_]
set_input_delay -clock clk  0.1  [get_ports coo_in_0__2_]
set_input_delay -clock clk  0.1  [get_ports coo_in_0__1_]
set_input_delay -clock clk  0.1  [get_ports coo_in_0__0_]
set_input_delay -clock clk  0.1  [get_ports coo_in_1__2_]
set_input_delay -clock clk  0.1  [get_ports coo_in_1__1_]
set_input_delay -clock clk  0.1  [get_ports coo_in_1__0_]
set_output_delay -clock clk  0.1  [get_ports {read_address[12]}]
set_output_delay -clock clk  0.1  [get_ports {read_address[11]}]
set_output_delay -clock clk  0.1  [get_ports {read_address[10]}]
set_output_delay -clock clk  0.1  [get_ports {read_address[9]}]
set_output_delay -clock clk  0.1  [get_ports {read_address[8]}]
set_output_delay -clock clk  0.1  [get_ports {read_address[7]}]
set_output_delay -clock clk  0.1  [get_ports {read_address[6]}]
set_output_delay -clock clk  0.1  [get_ports {read_address[5]}]
set_output_delay -clock clk  0.1  [get_ports {read_address[4]}]
set_output_delay -clock clk  0.1  [get_ports {read_address[3]}]
set_output_delay -clock clk  0.1  [get_ports {read_address[2]}]
set_output_delay -clock clk  0.1  [get_ports {read_address[1]}]
set_output_delay -clock clk  0.1  [get_ports {read_address[0]}]
set_output_delay -clock clk  0.1  [get_ports enable_read]
set_output_delay -clock clk  0.1  [get_ports {coo_address[2]}]
set_output_delay -clock clk  0.1  [get_ports {coo_address[1]}]
set_output_delay -clock clk  0.1  [get_ports {coo_address[0]}]
set_output_delay -clock clk  0.1  [get_ports done]
set_output_delay -clock clk  0.1  [get_ports max_addi_answer_0__1_]
set_output_delay -clock clk  0.1  [get_ports max_addi_answer_0__0_]
set_output_delay -clock clk  0.1  [get_ports max_addi_answer_1__1_]
set_output_delay -clock clk  0.1  [get_ports max_addi_answer_1__0_]
set_output_delay -clock clk  0.1  [get_ports max_addi_answer_2__1_]
set_output_delay -clock clk  0.1  [get_ports max_addi_answer_2__0_]
set_output_delay -clock clk  0.1  [get_ports max_addi_answer_3__1_]
set_output_delay -clock clk  0.1  [get_ports max_addi_answer_3__0_]
set_output_delay -clock clk  0.1  [get_ports max_addi_answer_4__1_]
set_output_delay -clock clk  0.1  [get_ports max_addi_answer_4__0_]
set_output_delay -clock clk  0.1  [get_ports max_addi_answer_5__1_]
set_output_delay -clock clk  0.1  [get_ports max_addi_answer_5__0_]
